# Accessing BigQuery from Colab
This notebook shows the simple steps needed to enable BigQuery access from a Colab notebook.

First, we need to authenticate this notebook so we get access to our Google Cloud account. Follow these steps:
1. Execute the cell below
2. Click on the provided URL
3. Select the account you wish to give access to
4. Allow access
5. Copy the passcode and past it in the box provided under the cell below

In [1]:
from google.colab import auth
auth.authenticate_user()

## Using `bigquery` magic function
You will need to specify which project this query will be billed to by providing `--project=<PROJECT-ID>`. You will need to replace your project ID with `<PROJECT-ID>`. Using this magic function, your cell becomes entirely a *BigQuery* cell and no longer operates as a *python* cell.

Below is a simple example:

In [2]:
%%bigquery --project=ba-770
SELECT corpus, SUM(word_count) total_word_count
FROM `bigquery-public-data.samples.shakespeare` 
GROUP BY corpus
ORDER BY total_word_count DESC
LIMIT 5

           corpus  total_word_count
0          hamlet             32446
1  kingrichardiii             31868
2      coriolanus             29535
3       cymbeline             29231
4    2kinghenryiv             28241